#pragma once
/**
    @file       Parygina_Class_Project.h
    @brief      Файл исходных кодов класса проекта
    @copyright  ВоГУ
    @author     Парыгина А.Д.
    @date       20-05-2024
    @version    1.0.0
\par Использует классы:
    @ref Parygina_Class_Project
\par Содержит класс:
    @ref Parygina_Class_Project
*/

/// Класс описания проекта
/** Программа выводит на консоль меню, состоящее из нескольких пунктов,
    с предложением выбрать один из них. При выборе пунктов 1-3,
    пользователю предлагается ввести вещественное число X, Y, и Z соответствено;
    при выборе пунктов 4 и 5 подсчитывается сумма дробных и целых частей
    введенных чисел и результат выводится на экран.
*/

class Parygina_Class_Project
{
protected:
    double _X; ///< первое число
    double _Y; ///< второе число
    double _Z; ///< третье число

public:
    /// Возвращает вещественное число X, введенное пользователем
    /**
    \return введенное с клавиатуры число */
    double EnterX();

    /// Возвращает вещественное число Y, введенное пользователем
    /**
    \return введенное с клавиатуры число */
    double EnterY();

    /// Возвращает вещественное число Z, введенное пользователем
    /**
    \return введенное с клавиатуры число */
    double EnterZ();

    /** \brief Находит сумму дробных частей трёх вещественных чисел
    @param X первое число
    @param Y второе число
    @param Z третье число
    @return cумма дробных частей чисел X, Y и Z */
    void FindFracSum(double X, double Y, double Z);

    /** \brief Находит сумму целых частей трёх вещественных чисел
    @param X первое число
    @param Y второе число
    @param Z третье число
    @return cумма целых частей чисел X, Y и Z */
    void FindIntSum(double X, double Y, double Z);
};